---
kind: other
id: Methods.T:Autodesk.Revit.DB.FailureDefinition
source: html/0ec5aae7-bfbb-9fc1-6706-54f9b563eb67.htm
---
# FailureDefinition Methods

Adds a type of possible resolution for the failure.